Update COLLECTORS.md
